IDEA StatiCa Open Model
ParameterInt Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Integer parameter of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ParameterInt
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ParameterInt : Parameter
Public Class ParameterInt
	Inherits Parameter
public ref class ParameterInt : public Parameter
The ParameterInt type exposes the following members.
Constructors
Name | Description
ParameterInt
Initializes a new instance of the ParameterInt class
Top
Properties
Name | Description
Name
 Name of property
 (Inherited from Parameter.)
Value
 Value
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace